
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ВыполнениеЗаказов Расход
	Движения.ВыполнениеЗаказов.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ВыполнениеЗаказов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ЗаказКлиента = Заказ_клиента;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Состояние = Перечисления.СостоянияТоваровПоЗаказу.НаСкладе;
		Движение.Количество = ТекСтрокаТовары.Уже_Выдано_Клиенту;
		Движение.Сумма = ТекСтрокаТовары.Итоговая_стоимость;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
