&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьВсеПоСтроке(Стр, ПроцентНаценки)
	
	// долг
	Стр.Осталось_выдать = Стр.Количество_в_заказе - Стр.Уже_Выдано_Клиенту;
	// Рачет сколько потратили на закупку
	Стр.Закупочная_стоимость = Стр.Количество_на_складе * Стр.Закупочная_цена;	
	//Рассчит цены
	ЦенаПродажи = Стр.Закупочная_цена * (1 + ПроцентНаценки / 100); 
	
	//Итоговая стоимость
	Если Стр.Осталось_выдать <= 0 Тогда
		Стр.Итоговая_стоимость = Стр.Количество_в_заказе * ЦенаПродажи;
	Иначе
		Стр.Итоговая_стоимость = Стр.Уже_Выдано_Клиенту * ЦенаПродажи;
	КонецЕсли;
	
	//Выручка
	Стр.Выручка = Стр.Итоговая_стоимость - (Стр.Уже_Выдано_Клиенту * Стр.Закупочная_цена);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПоЗаказуНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Заказ_клиента) Тогда
		Возврат;
	КонецЕсли;

	Объект.Товары.Очистить();

	Запрос = Новый Запрос;
	
	Запрос.Текст = 	 
		"ВЫБРАТЬ
		|	Поступление_товараПоступление.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(Поступление_товараПоступление.Закупочная_цена) КАК Закупочная_цена
		|ПОМЕСТИТЬ ВТ_ЦеныПоступления
		|ИЗ
		|	Документ.Поступление_товара.Поступление КАК Поступление_товараПоступление
		|ГДЕ
		|	Поступление_товараПоступление.Ссылка.Заказ_клиента = &Заказ_клиента
		|
		|СГРУППИРОВАТЬ ПО
		|	Поступление_товараПоступление.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заказ_КлиентаТовары.Номенклатура КАК Номенклатура,
		|	Заказ_КлиентаТовары.Количество КАК Количество_в_заказе,
		|	ЕСТЬNULL(ВыполнениеЗаказовОстатки.КоличествоОстаток, 0) КАК Количество_на_складе,
		|	ЕСТЬNULL(ВТ_ЦеныПоступления.Закупочная_цена, 0) КАК Закупочная_цена
		|ИЗ
		|	Документ.Заказ_Клиента.Товары КАК Заказ_КлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныПоступления КАК ВТ_ЦеныПоступления
		|		ПО Заказ_КлиентаТовары.Номенклатура = ВТ_ЦеныПоступления.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыполнениеЗаказов.Остатки(
		|				, // Период пустой (запятая осталась) - берем текущие остатки
		|				ЗаказКлиента = &Заказ_клиента
		|					И Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТоваровПоЗаказу.НаСкладе)) КАК ВыполнениеЗаказовОстатки
		|		ПО Заказ_КлиентаТовары.Номенклатура = ВыполнениеЗаказовОстатки.Номенклатура
		|ГДЕ
		|	Заказ_КлиентаТовары.Ссылка = &Заказ_клиента";
					
	Запрос.УстановитьПараметр("Заказ_клиента", Объект.Заказ_клиента);
	Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для Каждого Стр Из Объект.Товары Цикл
		
		Стр.Уже_Выдано_Клиенту = Мин(Стр.Количество_на_складе, Стр.Количество_в_заказе);
		
		РассчитатьВсеПоСтроке(Стр, Объект.Процент_наценки);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Заказ_клиентаПриИзменении(Элемент)
	ЗаполнитьТаблицуПоЗаказуНаСервере();
КонецПроцедуры           

&НаКлиенте
Процедура Процент_наценкиПриИзменении(Элемент)
		Для Каждого Стр Из Объект.Товары Цикл
		РассчитатьВсеПоСтроке(Стр, Объект.Процент_наценки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУже_Выдано_КлиентуПриИзменении(Элемент)
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		РассчитатьВсеПоСтроке(ТекущиеДанные, Объект.Процент_наценки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить_по_заказу(Команда)
	ЗаполнитьТаблицуПоЗаказуНаСервере();
КонецПроцедуры


