
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ВыполнениеЗаказов Расход
	Движения.ВыполнениеЗаказов.Записывать = Истина;
	Для Каждого ТекСтрокаПоступление Из Поступление Цикл
		Движение = Движения.ВыполнениеЗаказов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ЗаказКлиента = Заказ_клиента;
		Движение.Номенклатура = ТекСтрокаПоступление.Номенклатура;
		Движение.Состояние = Перечисления.СостоянияТоваровПоЗаказу.ОжидаетЗакупки;
		Движение.Количество = ТекСтрокаПоступление.Количество;
		Движение.Сумма = ТекСтрокаПоступление.Всего;
	КонецЦикла;

	// регистр ВыполнениеЗаказов Приход
	Движения.ВыполнениеЗаказов.Записывать = Истина;
	Для Каждого ТекСтрокаПоступление Из Поступление Цикл
		Движение = Движения.ВыполнениеЗаказов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ЗаказКлиента = Заказ_клиента;
		Движение.Номенклатура = ТекСтрокаПоступление.Номенклатура;
		Движение.Состояние = Перечисления.СостоянияТоваровПоЗаказу.НаСкладе;
		Движение.Количество = ТекСтрокаПоступление.Количество;
		Движение.Сумма = ТекСтрокаПоступление.Всего;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
